import React, { useEffect } from 'react';
import CarbonDataTable from 'Components/CarbonDataTable.jsx';
import './EmployeeTravel.css';

import {
    Link,
    Route,
    Routes,
} from 'react-router-dom';

const dataHeaders = [
    '紀錄', '姓名', '員工編號', '出差時間', '交通工具', '公里數', '碳足跡-KG', '查看'
]

const fakeData = [
    { '紀錄': '自動', '姓名': '陳美華', '員工編號': 'A001', '出差時間': '10:00-15:12', '交通工具': '火車、公車、走路、機車', '公里數': 25, '碳足跡-KG': 2.02, '查看': '🔍' },
    { '紀錄': '手動', '姓名': '許曉明', '員工編號': 'B002', '出差時間': '13:00-14:12', '交通工具': '走路、汽車', '公里數': 15, '碳足跡-KG': 1.89, '查看': '🔍' },
    { '紀錄': '自動', '姓名': '王揚鈞', '員工編號': 'A002', '出差時間': '15:00-15:32', '交通工具': '公車', '公里數': 7, '碳足跡-KG': 1.06, '查看': '🔍' },
    { '紀錄': '自動', '姓名': '陳姓會', '員工編號': 'A005', '出差時間': '09:00-12:12', '交通工具': '機車', '公里數': 13, '碳足跡-KG': 5.02, '查看': '🔍' },
    { '紀錄': '自動', '姓名': '吳勝明', '員工編號': 'A006', '出差時間': '09:08-10:12', '交通工具': '機車', '公里數': 32, '碳足跡-KG': 10.02, '查看': '🔍' },
    { '紀錄': '手動', '姓名': '林秉聖', '員工編號': 'B008', '出差時間': '13:00-14:12', '交通工具': '走路、汽車', '公里數': 6, '碳足跡-KG': 1.89, '查看': '🔍' },
    { '紀錄': '自動', '姓名': '孫燕姿', '員工編號': 'A007', '出差時間': '11:00-13:12', '交通工具': '走路、機車', '公里數': 12, '碳足跡-KG': 1.02, '查看': '🔍' },
    { '紀錄': '自動', '姓名': '莫可霖', '員工編號': 'A009', '出差時間': '10:00-15:12', '交通工具': '火車、公車、走路、機車', '公里數': 15, '碳足跡-KG': 2.02, '查看': '🔍' },
]

function EmployeeTravel() {


    return (
        <div className='employee-travel'>
            <div>
                <CarbonDataTable headers={dataHeaders} data={fakeData} />
            </div>
        </div>
    );
}
export default EmployeeTravel;